[
    {
        "title": "REVOLVING DOOR: Between 2006 and 2019, 90% of FDA commissioners went on to work for Big Pharma",
        "description": "If you think there is any substantial difference between the U.S. Food and Drug Administration (FDA) and the pharmaceutical companies it (supposedly)...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-90-percent-fda-commissioners-work-big-pharma.html"
    },
    {
        "title": "Science-backed health benefits of ancient remedy GINGER",
        "description": "For thousands of years, ginger has captivated cultures across the globe with its powerful effects, unique taste and healing reputation. This knobby...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-science-backed-health-benefits-ancient-remedy-ginger.html"
    },
    {
        "title": "New study links childhood asthma to higher risk of cognitive challenges later in life",
        "description": "A recent study published in JAMA Network Open has found that children who develop asthma before the age of 12 may be at greater risk of cognitive...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-study-childhood-asthma-higher-risk-cognitive-challenges.html"
    },
    {
        "title": "New Zealand cardiologists concede the simple truth: Spike protein generated by mRNA COVID vaccines is a CARDIOTOXIN",
        "description": "At a recent cardiology meeting in Auckland, New Zealand, a striking admission was made: the spike protein generated by mRNA COVID-19 vaccines is now...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-cardiologists-spike-protein-mrna-covid-vaccines-cardiotoxin.html"
    },
    {
        "title": "Health district board in Idaho to stop offering COVID-19 vaccines at medical centers",
        "description": "The board of health for Idaho's southwestern health district has voted to stop offering Wuhan coronavirus (COVID-19) vaccinations at its medical...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-idaho-health-district-stop-offering-covid-vaccines.html"
    },
    {
        "title": "Ancient herb SUMMER SAVORY contains compounds that promote health and wellness",
        "description": "If summer savory (Satureja hortensis) has not yet made it into your spice rack collection, you might be missing out on a centuries-old herb that is...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-herb-summer-savory-compounds-promote-health-wellness.html"
    },
    {
        "title": "The top 4 healing properties of avocados",
        "description": "Not only is avocado an exceptionally dense source of good fats, vitamins, and antioxidants, but it offers protection against some of the worst...",
        "date": "11/15/2024",
        "url": "https://naturalnews.com/2024-11-15-the-top-4-healing-properties-of-avocados.html"
    },
    {
        "title": "Trump announces plan to end deep state corruption in Washington “once and for all”",
        "description": "In a public address to the nation, President Trump outlined how he plans to completely and permanently dismantle the Washington deep state while...",
        "date": "11/14/2024",
        "url": "https://naturalnews.com/2024-11-14-trump-plan-end-deep-state-corruption-forever.html"
    },
    {
        "title": "Dutch health minister admits that COVID-19 was a “military operation” involving NATO",
        "description": "A Dutch government official recently stated that the COVID-19 pandemic was a “military operation” and that the Netherlands followed orders...",
        "date": "11/14/2024",
        "url": "https://naturalnews.com/2024-11-14-dutch-health-minister-covid-military-operation-nato.html"
    },
    {
        "title": "College students distraught by Trump election victory given therapy CATS and DUCKS to cope",
        "description": "Many college students didn't cope well following President-elect Donald Trump's victory, leading some educational institutions to offer therapy...",
        "date": "11/14/2024",
        "url": "https://naturalnews.com/2024-11-14-students-distraught-trump-victory-therapy-cats-ducks.html"
    },
    {
        "title": "Here’s what eating tomatoes every day can do for you",
        "description": "Never underestimate the power of the humble tomato. Although tomatoes are botanically defined as \"fruits\" because they develop from a flower and...",
        "date": "11/14/2024",
        "url": "https://naturalnews.com/2024-11-14-what-eating-tomatoes-daily-can-do-for-you.html"
    },
    {
        "title": "Sesame seeds and oil: A natural boost for optimal health and wellness",
        "description": "With a long history in traditional medicine, sesame seeds are often called upon to help treat various health conditions. Rich in bioactive...",
        "date": "11/14/2024",
        "url": "https://naturalnews.com/2024-11-14-sesame-seeds-and-oil-optimal-health-wellness.html"
    },
    {
        "title": "Turmeric: Better than aspirin for heart disease prevention?",
        "description": "In a day and age where people identify heart disease prevention strategies with consuming what are essentially toxic chemicals like...",
        "date": "11/14/2024",
        "url": "https://naturalnews.com/2024-11-14-turmeric-better-than-aspirin-heart-disease-prevention.html"
    },
    {
        "title": "RFK Jr. says Bill Gates, Fauci will both be arrested under Trump",
        "description": "Now that Donald Trump has been reelected as president of the United States, Robert F. Kennedy Jr. is ready to get to work locking up Bill Gates, Tony...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-rfk-jr-bill-gates-fauci-arrested-trump.html"
    },
    {
        "title": "Founder of an alliance for detransitioners supports Alberta’s ban on sexual mutilation of gender-confused minors",
        "description": "The founder of an alliance for detransitioners has officially endorsed Alberta's pro-family policy that bans sex reassignment surgery on...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-detransitioners-support-albertas-ban-on-gender-mutilation.html"
    },
    {
        "title": "Canada’s intelligence service posts DEI-based summer job and permanent work opportunities – gender, race and disability are the primary job qualifications now",
        "description": "The Canadian Security Intelligence Service (CSIS) recently posted summer job opportunities for students and permanent staff based on diversity,...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-canada-intelligence-service-posts-dei-based-jobs.html"
    },
    {
        "title": "Lawsuit accuses Pfizer of hiding popular contraceptive’s link to BRAIN TUMORS",
        "description": "Pharmaceutical giant Pfizer has been accused in a lawsuit of hiding the link between its injectable contraceptive Depo-Provera and brain...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-lawsuit-pfizer-hiding-contraceptive-link-brain-tumors.html"
    },
    {
        "title": "Dr. Peter McCullough calls on Trump to WITHDRAW COVID-19 injections from the market",
        "description": "Cardiologist Dr. Peter McCullough has urged President-elect Donald Trump to withdraw the Wuhan coronavirus (COVID-19) vaccines from the market, which...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-mccullough-urges-trump-withdraw-covid-injections-market.html"
    },
    {
        "title": "Costco forced to recall almost 80,000 pounds of butter after label fails to mention it contains MILK, proving the FDA is a terrorist organization that destroys the food supply",
        "description": "Grocery chain Costco has been forced to recall tens of thousands of pounds (lbs) of butter after its label failed to mention that it contains milk,...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-costco-recalls-butter-label-fail-mention-milk.html"
    },
    {
        "title": "Science-backed benefits of oregano essential oil for skin health",
        "description": "Oregano essential oil is a potent extract of the historic, cherished herb that has shown powerful anti-inflammatory, antimicrobial and antioxidant...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-science-backed-benefits-oregano-essential-oil-skin.html"
    },
    {
        "title": "What happens when you replace breakfast carbs with fat-rich avocado?",
        "description": "Fat has long suffered a bad rap and a long-time association with poor health and disease. One study, however, highlights what happens to your body --...",
        "date": "11/13/2024",
        "url": "https://naturalnews.com/2024-11-13-replace-breakfast-carbs-with-avocado.html"
    },
    {
        "title": "Pharmaceutical CEOs panicking over Trump victory as RFK Jr. prepares to overhaul corrupt FDA",
        "description": "While every American who cares about their health and their health freedom is feeling optimistic about Trump's victory in light of his vow to give...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-pharmaceutical-ceos-panicking-trump-victory-rfk-overhaul-fda.html"
    },
    {
        "title": "Health Ranger offers to share mass spec laboratory resources to REPLACE failed FDA as MAHA and MAGA get to work cleaning up U.S. food and water supplies",
        "description": "In a post-election announcement, the Health Ranger offered up years of expertise and the use of mass spec testing equipment from his hi-tech...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-health-ranger-share-mass-spec-laboratory-fda.html"
    },
    {
        "title": "Get to the root cause: How to recognize and treat common nutrient deficiencies",
        "description": "Many of today’s chronic diseases can be traced back to nutrient deficiencies and the inability to properly absorb vitamins and minerals. An...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-how-to-recognize-treat-common-nutrient-deficiencies.html"
    },
    {
        "title": "Mike Adams Sermon 36: SPIKENARD as God’s calming, neuro-modulating anointing and medicinal oil",
        "description": "The Health Ranger Mike Adams discussed spikenard as God's anointing and medicinal oil during his 36th sermon, part of his 100 Sermons series for the...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-sermon-36-spikenard-gods-calming-anointing-oil.html"
    },
    {
        "title": "Kamala Harris says she will continue to fight for abortion during concession speech",
        "description": "After losing against President-elect Donald Trump, Vice President Kamala Harris vowed that she would not give up her \"fight for democracy, especially...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-harris-will-continue-fighting-for-abortion.html"
    },
    {
        "title": "Study: Early exposure to smartphones, online content linked to increased risk of autism",
        "description": "The results of the Australian government-funded \"Longitudinal Study of Australian Children\" have revealed a significant link between early screen...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-early-screen-exposure-linked-later-autism-diagnosis.html"
    },
    {
        "title": "Judge rules AstraZeneca, other COVID jab makers NOT immune from injury claims for breach of contract",
        "description": "The Public Readiness and Emergency Preparedness (PREP) Act, which Congress passed just before President Trump declared a public health emergency for...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-judge-astrazeneca-covid-vaccine-makers-not-immune.html"
    },
    {
        "title": "Radical pro-abortion amendments pass in Arizona, Colorado, Maryland, Montana, Missouri, New York and Nevada",
        "description": "Radical pro-abortion amendments have passed in seven states, namely Arizona, Colorado, Maryland, Montana, Missouri, New York and Nevada, after...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-pro-abortion-amendments-pass-in-seven-states.html"
    },
    {
        "title": "Oregano: A small green leaf with big health benefits",
        "description": "Many people see oregano as just another herb – a small green leaf that adds something extra to pasta sauces or pizzas. But throughout history, this...",
        "date": "11/12/2024",
        "url": "https://naturalnews.com/2024-11-12-oregano-small-green-leaf-big-health-benefits.html"
    },
    {
        "title": "Do humans have a latent ability to regenerate body parts?",
        "description": "We’ve all heard of salamanders and other amphibians regrowing limbs, but can humans do the same? Your first instinct might be to say that this is...",
        "date": "11/11/2024",
        "url": "https://naturalnews.com/2024-11-11-humans-latent-ability-regenerate-body-parts.html"
    },
    {
        "title": "The 30-year DISEASE and DISORDER chart that will blow your mind",
        "description": "If you don’t believe that conventional food and allopathic medicine in the USA are the main causes of disease and disorder, then ask yourself, what...",
        "date": "11/11/2024",
        "url": "https://naturalnews.com/2024-11-11-the-30-year-disease-and-disorder-chart.html"
    },
    {
        "title": "CONFIRMED: Algerian boxer Imane Khelif is, in fact, a MALE boxing as a “transwoman”",
        "description": "Just as many critics said all along was the case, Algerian boxer Imane Khelif is a confirmed transgender. A leaked French medical report from 2023...",
        "date": "11/11/2024",
        "url": "https://naturalnews.com/2024-11-11-algerian-boxer-imane-khelif-male-transwoman.html"
    },
    {
        "title": "Democratic Sen. Bob Casey claims to oppose the participation of transgender athletes in women’s sports, but his record says otherwise",
        "description": "Sen. Bob Casey (D-PA) claims to oppose the participation of transgender athletes in women's sports, but his statements and voting record show...",
        "date": "11/11/2024",
        "url": "https://naturalnews.com/2024-11-11-bob-casey-claims-oppose-men-in-womens-sports.html"
    },
    {
        "title": "Muscles and immunity: How building muscle boosts your immune system",
        "description": "Maintaining a healthy muscle mass throughout your life means having a valuable reserve of amino acids that can help your immune system fight...",
        "date": "11/11/2024",
        "url": "https://naturalnews.com/2024-11-11-how-building-muscle-boosts-your-immune-system.html"
    },
    {
        "title": "Judge rules against AstraZeneca for breaching COVID “vaccine” contract with trial participant injured by experimental jab",
        "description": "Another victory was won this week after Utah mom Brianne Dressen received favor from Judge Robert Shelby concerning injuries she sustained from...",
        "date": "11/11/2024",
        "url": "https://naturalnews.com/2024-11-11-judge-rules-against-astrazeneca-covid-vaccine-contract.html"
    },
    {
        "title": "Robert F. Kennedy Jr. will assume a NEW role in public health, could liberate children from the 77+ dose vaccine schedule",
        "description": "Robert F. Kennedy Jr. is in position to assume an important new role within the federal government, a role that has never been filled before. For the...",
        "date": "11/10/2024",
        "url": "https://naturalnews.com/2024-11-10-rfkjr-will-assume-new-role-in-public-health.html"
    },
    {
        "title": "Leaked medical reports prove Algerian boxer and Olympic gold medalist Imane Khelif is biologically male",
        "description": "Leaked fragments of prior medical reports of Algerian athlete Imane Khelif prove that the controversial boxer is biologically male. Originally...",
        "date": "11/10/2024",
        "url": "https://naturalnews.com/2024-11-10-medical-reports-prove-imane-khelif-biologically-male.html"
    }
]