[
    {
        "title": "A Thanksgiving Message from Tucker Carlson",
        "summary": "Thank you to all of our supporters who make telling the truth possible. Happy Thanksgiving.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-thanksgiving-message"
    },
    {
        "title": "Dr. Mark Hyman: Everything You're Eating Is Toxic, and Big Pharma Likes It That Way",
        "summary": "Big companies are poisoning Americans. Dr. Mark Hyman has been saying that for thirty years. He’s finally been vindicated.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-mark-hyman"
    },
    {
        "title": "Willie Robertson: The Unlikely Origin of Duck Dynasty, Willie’s New Show, & Why Trump Won",
        "summary": "The great Willie Robertson.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-willie-robertson"
    },
    {
        "title": "Glenn Greenwald: Dangerous New Escalation in Russia, & Our Blackmailed Politicians",
        "summary": "Permanent Washington decides nuclear war is preferable to Donald Trump. Glenn Greenwald on the nihilism of our ruling class.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-glenn-greenwald-2"
    },
    {
        "title": "Tucker Carlson and Russ Vought Break Down DOGE and All of Trump’s Cabinet Picks So Far",
        "summary": "Russ Vought ran OMB under Trump the first time, and hopefully will again. Here’s what he learned about how the deep state actually works.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-russ-vought"
    },
    {
        "title": "Fasting, Prayer, Meditation, & the Global Persecution of Christians (With Hallow CEO Alex Jones)",
        "summary": "Alex Jones is the creator of Hallow, the biggest Christian prayer app of all time. He’s changing the world more profoundly than any politician. Hallow: X: https://x.com/HallowApp Alex (\"Alex at Hallow\"): X: https://x.com/alexathallow",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-alex-jones-hallow"
    },
    {
        "title": "Tucker Carlson: How Joe Rogan Changed Media Forever, How Propaganda Fools People, & Advice to Trump",
        "summary": "Good leaders don’t foment pointless wars. They end them. If you voted for Donald Trump, that’s reason enough to be proud you did.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-speech-genius-network"
    },
    {
        "title": "National Security Expert Elbridge Colby’s Advice to Trump on How to Avoid WWIII & Handle the CIA",
        "summary": "Elbridge Colby is one of the very few experienced national security officials who actually agrees with Donald Trump. He’s likely to play a big role in the new administration.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-elbridge-colby"
    },
    {
        "title": "Vivek Ramaswamy: Trump’s Sweeping Victory, & What It Means for the Future of Government Bureaucracy",
        "summary": "Vivek Ramaswamy on how good just triumphed over evil.",
        "posted_date": "2024-12-04",
        "url": "https://tuckercarlson.com/tucker-show-vivek"
    }
]